{"config": [{"config": {"input_dtype": "float32", "name": "averagepooling2d_1", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"bias": true, "b_constraint": null, "nb_row": 7, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_filter": 32, "name": "convolution2d_1", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 7, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_1", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.8}, "class_name": "Dropout"}, {"config": {"name": "averagepooling2d_2", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"bias": true, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_filter": 64, "name": "convolution2d_2", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_2", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.8}, "class_name": "Dropout"}, {"config": {"name": "averagepooling2d_3", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"bias": true, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_filter": 128, "name": "convolution2d_3", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_3", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.8}, "class_name": "Dropout"}, {"config": {"name": "averagepooling2d_4", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"bias": true, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_filter": 256, "name": "convolution2d_4", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_4", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.8}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dtype": "float32", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "input_dim": 12800, "output_dim": 7680, "name": "dense_1", "batch_input_shape": [null, 12800], "init": "normal", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "name": "batchnormalization_5", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dtype": "float32", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "input_dim": 7680, "output_dim": 1, "name": "dense_2", "batch_input_shape": [null, 7680], "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}